[
    {
        "id": 1,
        "title": "AI Document Summarizer",
        "roi": 8,
        "roi_reason": "Improves productivity by reducing time spent on reading lengthy documents.",
        "effort": 6,
        "effort_reason": "Requires development and integration with existing systems.",
        "rank": 7
    },
    {
        "id": 2,
        "title": "Cross-Department Collaboration Hub",
        "roi": 9,
        "roi_reason": "Increases productivity by streamlining communication and collaboration across departments.",
        "effort": 8,
        "effort_reason": "Requires significant development, integration with existing tools, and adoption across the organization.",
        "rank": 3
    },
    {
        "id": 3,
        "title": "Smart Employee Onboarding",
        "roi": 7,
        "roi_reason": "Reduces time spent on onboarding tasks and improves new hire productivity.",
        "effort": 6,
        "effort_reason": "Requires development and integration with HR systems.",
        "rank": 9
    },
    {
        "id": 4,
        "title": "Customer Sentiment Dashboard",
        "roi": 8,
        "roi_reason": "Allows for quick identification of customer satisfaction trends, enabling targeted action.",
        "effort": 7,
        "effort_reason": "Requires integration with multiple communication channels and may need human oversight.",
        "rank": 5
    },
    {
        "id": 5,
        "title": "VR Training Simulations",
        "roi": 9,
        "roi_reason": "Reduces costs associated with training for high-risk procedures and improves safety.",
        "effort": 9,
        "effort_reason": "Requires significant development and investment in VR hardware.",
        "rank": 2
    },
    {
        "id": 6,
        "title": "Predictive Maintenance System",
        "roi": 8,
        "roi_reason": "Reduces downtime and maintenance costs by predicting equipment failures.",
        "effort": 8,
        "effort_reason": "Requires investment in IoT sensors and development of prediction algorithms.",
        "rank": 6
    },
    {
        "id": 7,
        "title": "Contract Analysis Tool",
        "roi": 7,
        "roi_reason": "Reduces legal risks by flagging potential issues and extracting key obligations.",
        "effort": 8,
        "effort_reason": "Requires development of AI capabilities for understanding complex legal language.",
        "rank": 10
    },
    {
        "id": 8,
        "title": "Carbon Footprint Tracker",
        "roi": 6,
        "roi_reason": "Provides visibility into environmental impact and may incentivize greener practices.",
        "effort": 7,
        "effort_reason": "Requires data collection across various departments and potentially significant development.",
        "rank": 11
    },
    {
        "id": 9,
        "title": "Meeting Efficiency Assistant",
        "roi": 8,
        "roi_reason": "Saves time by automating note-taking, action item assignment, and follow-ups.",
        "effort": 6,
        "effort_reason": "Requires development and integration with calendar systems.",
        "rank": 7
    },
    {
        "id": 10,
        "title": "Internal Knowledge Wiki",
        "roi": 7,
        "roi_reason": "Improves productivity by making company knowledge more accessible.",
        "effort": 5,
        "effort_reason": "Requires development and population of the wiki with useful content.",
        "rank": 12
    },
    {
        "id": 11,
        "title": "Automated Data Cleanup",
        "roi": 8,
        "roi_reason": "Improves data accuracy, reducing errors and saving time on manual cleanup.",
        "effort": 7,
        "effort_reason": "Requires development of automated algorithms for detecting and correcting inconsistencies.",
        "rank": 4
    },
    {
        "id": 12,
        "title": "Customer Journey Visualizer",
        "roi": 8,
        "roi_reason": "Provides insights into customer behavior, enabling targeted marketing and improved products.",
        "effort": 7,
        "effort_reason": "Requires integration with multiple touchpoints and data analysis capabilities.",
        "rank": 5
    },
    {
        "id": 13,
        "title": "Team Wellness Platform",
        "roi": 6,
        "roi_reason": "Improves team productivity by promoting wellbeing and reducing absenteeism.",
        "effort": 7,
        "effort_reason": "Requires development of personalized interventions and employee buy-in.",
        "rank": 13
    },
    {
        "id": 14,
        "title": "Supply Chain Optimization",
        "roi": 9,
        "roi_reason": "Reduces costs, delays, and stockouts by optimizing the supply chain.",
        "effort": 8,
        "effort_reason": "Requires significant development of AI capabilities for predicting demand and managing logistics.",
        "rank": 1
    },
    {
        "id": 15,
        "title": "One-Click Report Generator",
        "roi": 7,
        "roi_reason": "Saves time by automating report generation from multiple data sources.",
        "effort": 4,
        "effort_reason": "Requires development of integration with various data sources and generation algorithms.",
        "rank": 8
    },
    {
        "id": 16,
        "title": "Skill Gap Analysis Tool",
        "roi": 7,
        "roi_reason": "Identifies skill gaps within the organization, enabling targeted training.",
        "effort": 6,
        "effort_reason": "Requires development of algorithms for analyzing employee skills and performance data.",
        "rank": 14
    },
    {
        "id": 17,
        "title": "Employee Engagement Dashboard",
        "roi": 6,
        "roi_reason": "Provides insights into employee engagement, enabling targeted interventions.",
        "effort": 5,
        "effort_reason": "Requires data collection across various touchpoints and analysis capabilities.",
        "rank": 15
    }
]